# ReadXMLMemory

## Description
Parses XML data in memory.

```pascal
FUNCTION ReadXMLMemory(
				XMLHandle : LONGINT;
				XMLData   : DYNARRAY[] of CHAR) : INTEGER;
```

```python

def vs.ReadXMLMemory(XMLHandle, XMLData):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT||
|XMLData|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2011
## Category
* XML